<?php
// Массив открыток, сгруппированных по полу
$cardsByGender = [
    'male' => [
        'https://ссылка_на_изображение.ru/1.jpg',
		'https://ссылка_на_изображение.ru/2.jpg',	
    ],
    'female' => [
		'https://ссылка_на_изображение.ru/3.jpg',
		'https://ссылка_на_изображение.ru/3.jpg',
    ],
    'both' => [
		'https://ссылка_на_изображение.ru/5.jpg',
		'https://ссылка_на_изображение.ru/6.jpg',
    ],
    'unknown' => [
		'https://ссылка_на_изображение.ru/7.jpg',
		'https://ссылка_на_изображение.ru/8.jpg',
    ]
];
